{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Relu",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Relu1",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "20",
          "64"
        ],
        "dataType": 1,
        "floatData": [
          -0.08707983,
          0.40864906,
          -0.16240712,
          0.1261628,
          0.05409295,
          -0.5184172,
          -0.3067804,
          0.1711242,
          0.19693811,
          0.10142478,
          -0.5446134,
          0.37528682,
          0.055112995,
          -0.3400929,
          -0.5125116,
          -0.24122831,
          -0.2105709,
          -0.08658069,
          0.033158164,
          -0.28504425,
          0.22093931,
          -0.6100643,
          -0.3648816,
          -0.43477595,
          -0.039503742,
          0.19610651,
          -0.34686828,
          0.022833264,
          -0.40348127,
          -0.7099181,
          0.2530101,
          0.21335112,
          0.070564695,
          0.36726674,
          0.11384191,
          0.12925403,
          -0.21570243,
          -0.36956215,
          0.21593335,
          -0.040277064,
          -0.18078378,
          -0.2795409,
          -0.10847571,
          0.11195257,
          0.040106814,
          0.15420495,
          -0.17871583,
          -0.1541726,
          -0.09752839,
          -0.72772396,
          0.3077391,
          -0.06214349,
          0.20545372,
          -0.08360369,
          0.09890877,
          0.25102767,
          -0.49578074,
          -0.52298707,
          -0.3630684,
          -0.061565742,
          0.00927861,
          -0.30921337,
          0.3041514,
          -0.2500253,
          -0.1218234,
          0.21528739,
          -0.37965387,
          0.1739802,
          -0.38176718,
          0.18329228,
          0.16851446,
          0.01319041,
          -0.40542966,
          0.20275775,
          -0.17126837,
          0.09920712,
          0.13401254,
          -0.34104985,
          -0.25640526,
          -0.25839424,
          -0.04574338,
          0.12852907,
          0.24507236,
          -0.343683,
          -0.09839653,
          -0.47425202,
          -0.09339586,
          0.013799654,
          0.33930302,
          0.44866675,
          -0.4215911,
          0.13970003,
          -0.09145454,
          0.03459061,
          -0.011265155,
          0.1464387,
          0.21076904,
          -0.14257796,
          -0.31905177,
          -0.029177148,
          -0.172832,
          -0.13327739,
          -0.2705682,
          0.19999352,
          0.4982918,
          -0.44333225,
          0.02453317,
          0.21054745,
          -0.16734646,
          -0.11115486,
          -0.076062664,
          -0.48972812,
          0.39798108,
          -0.098175384,
          -0.02978248,
          0.3146648,
          0.21701033,
          -0.29042304,
          0.19935396,
          -0.0029607485,
          0.2589226,
          0.053368855,
          -0.16628477,
          -0.020262582,
          -0.25717613,
          -0.04394616,
          0.44073033,
          0.26748613,
          -0.21126924,
          -0.04762256,
          0.028152896,
          -0.17621316,
          -0.14630914,
          -0.20599402,
          0.26553965,
          -0.53545713,
          0.20373833,
          0.12796159,
          0.03652257,
          0.4207813,
          0.14227343,
          -0.1705531,
          -0.07606476,
          -0.21691993,
          0.03230535,
          -0.27743995,
          0.08358667,
          0.26218915,
          -0.3830586,
          0.0163145,
          0.1732176,
          -0.16062234,
          -0.23796122,
          -0.06768579,
          0.15162116,
          -0.0707699,
          0.119462244,
          0.29812765,
          -0.107837416,
          0.1607754,
          -0.11356734,
          0.12823324,
          0.12081309,
          0.10442306,
          -0.26106986,
          0.5296941,
          -0.50915897,
          -0.23088577,
          -0.2935321,
          -0.008672631,
          -0.015803186,
          -0.66470444,
          0.30187255,
          -0.19106874,
          0.06524151,
          -0.18819377,
          0.12654833,
          -0.031355213,
          0.36294687,
          -0.2499678,
          -0.13819695,
          -0.3627913,
          0.0013267954,
          0.37450317,
          -0.19401361,
          0.090611584,
          0.037875116,
          -0.07657587,
          0.076503515,
          -0.09614472,
          -0.17456865,
          0.2386567,
          0.16434315,
          0.008423126,
          -0.14855883,
          0.27418095,
          0.24999125,
          0.1474291,
          0.035463054,
          0.19153272,
          0.3139569,
          -0.16615649,
          -0.14213952,
          0.23651946,
          0.06926373,
          -0.18384987,
          -0.19036703,
          -0.036695536,
          -0.26184896,
          -0.3589089,
          -0.07655335,
          0.054688707,
          -0.16523321,
          -0.07368183,
          0.19017725,
          -0.17391822,
          -0.39382663,
          0.3126875,
          0.37102008,
          0.14742705,
          0.1877679,
          0.042179525,
          -0.2485671,
          -0.116385095,
          -0.35531718,
          -0.14101772,
          0.3600996,
          -0.037866343,
          0.238351,
          0.3296376,
          0.3040498,
          0.09720293,
          0.24507348,
          -0.1335105,
          -0.4507578,
          0.056762334,
          -0.033911724,
          -0.18177141,
          0.18571098,
          0.022178834,
          0.21823145,
          0.2593102,
          -0.033087242,
          -0.09452638,
          -0.28438407,
          -0.050409567,
          0.036762852,
          0.1831667,
          0.1571391,
          0.24554415,
          -0.31077743,
          -0.4274756,
          0.18833308,
          -0.14973152,
          -0.32203335,
          -0.19758424,
          0.086827144,
          0.06927303,
          0.1431486,
          -0.5803345,
          0.07932186,
          0.27051044,
          -0.37272164,
          -0.21905063,
          0.0339326,
          0.08631808,
          0.24904041,
          0.15402134,
          -0.07118327,
          -0.19419979,
          0.29960886,
          0.26143652,
          0.39849427,
          0.2845709,
          -0.13283043,
          -0.031812705,
          0.14550553,
          0.037192732,
          0.13468969,
          0.27406228,
          0.13975108,
          -0.030008614,
          0.083414264,
          -0.54091674,
          0.32407695,
          -0.41673672,
          -0.1838278,
          -0.022762133,
          0.08096867,
          0.15600936,
          -0.09096642,
          -0.13683935,
          0.2449131,
          0.20063752,
          -0.41362807,
          -0.43300688,
          -0.088165425,
          -0.105113566,
          0.23903592,
          -0.1819954,
          -0.030265694,
          -0.14695062,
          0.14338703,
          -0.024866002,
          0.26732105,
          0.21626204,
          0.15028071,
          -0.10030059,
          0.024613697,
          -0.036146387,
          0.00377176,
          -0.50750494,
          -0.38023043,
          0.17352234,
          0.19655429,
          0.33880097,
          -0.0047159432,
          -0.35570902,
          -0.15513809,
          -0.42464402,
          0.08038737,
          0.15344168,
          0.15632772,
          0.24885416,
          0.35903758,
          0.20977195,
          0.1842594,
          -0.040099606,
          -0.0047910986,
          -0.16563115,
          0.0045646187,
          -0.20459072,
          -0.6046353,
          -0.13169584,
          -0.07154446,
          -0.43026355,
          0.30985838,
          0.15518829,
          -0.17828779,
          -0.008808039,
          -0.051872727,
          -0.05649517,
          -0.13095145,
          0.12797607,
          -0.15949695,
          -0.10470605,
          0.17480616,
          0.14572734,
          0.047711916,
          0.14422317,
          0.091457166,
          0.3029164,
          0.078705266,
          -0.12054659,
          -0.7035258,
          0.18180346,
          -0.27797025,
          -0.08642474,
          0.026136607,
          0.35360327,
          0.07161082,
          0.077359214,
          0.18007262,
          -0.10900399,
          0.30824813,
          0.07889923,
          0.29894558,
          0.19722404,
          -0.6046928,
          -0.05547342,
          0.001810418,
          -0.4150009,
          -0.058969792,
          0.039598744,
          -0.45730463,
          -0.020312263,
          0.06593712,
          -0.19089368,
          0.29357815,
          -0.5786399,
          -0.2847793,
          0.046198476,
          0.13351186,
          0.0991951,
          0.5789789,
          -0.06251982,
          -0.09486746,
          -0.07556675,
          0.15246557,
          0.04311692,
          0.3045506,
          0.01768698,
          -0.009115477,
          0.30866203,
          -0.06935921,
          0.3319086,
          0.19868785,
          0.031138096,
          0.12736474,
          0.13438025,
          -0.23653647,
          0.2702156,
          0.1283511,
          0.35397884,
          -0.18486145,
          0.37505388,
          -0.115513206,
          -0.36757323,
          0.19026941,
          -0.5854989,
          -0.08313321,
          0.24816878,
          0.3582956,
          -0.13659558,
          0.097399384,
          -0.26043737,
          -0.15265061,
          -0.121386275,
          -0.07294793,
          -0.18024522,
          0.23465344,
          0.1419745,
          -0.40026432,
          0.08349899,
          -0.42316633,
          0.06592207,
          -0.0029749984,
          0.14159152,
          -0.42802516,
          -0.31911117,
          -0.093408026,
          0.3714446,
          0.0357869,
          -0.46321076,
          -0.38477245,
          0.1078298,
          -0.22519293,
          0.17958851,
          -0.13660379,
          -0.040928528,
          -0.15211275,
          0.57851565,
          -0.23083642,
          -0.1372854,
          0.38374287,
          0.27350998,
          0.09569806,
          0.21584731,
          0.12415279,
          -0.35944387,
          -0.027083045,
          0.11936762,
          -0.20323665,
          0.19760294,
          -0.24708319,
          -0.029561944,
          -0.50513273,
          0.15127298,
          -0.28683257,
          -0.62441397,
          -0.18533604,
          0.097282484,
          0.11832308,
          0.02820025,
          0.13657159,
          0.028091738,
          0.0389277,
          0.21196756,
          -0.2061037,
          0.24867274,
          -0.45093983,
          0.46160588,
          -0.23158118,
          0.14405718,
          -0.14035307,
          0.24630497,
          -0.25648522,
          0.08717126,
          0.3448609,
          -0.14950849,
          0.16401026,
          0.24291843,
          -0.08292461,
          -0.061447147,
          0.12178,
          0.070428915,
          -0.26568094,
          -0.044642247,
          0.2736866,
          0.20602891,
          0.10544842,
          -0.026862029,
          -0.4195016,
          0.0031476764,
          0.053140365,
          -0.15045129,
          0.13507913,
          -0.3315536,
          0.27341455,
          0.3094271,
          0.21189106,
          0.054057054,
          -0.18758494,
          0.18422328,
          0.013803749,
          -0.32812503,
          0.3098948,
          0.16137841,
          0.33152255,
          0.0460769,
          0.1481565,
          -0.13179281,
          1.0494006e-06,
          1.6124302e-08,
          -2.9061491e-06,
          -6.2795625e-06,
          -9.298552e-34,
          5.4831775e-11,
          1.0439719e-05,
          -3.972222e-09,
          -3.152679e-36,
          2.9170076e-34,
          5.4296665e-06,
          1.96799e-09,
          1.3526859e-09,
          6.104492e-39,
          -7.683795e-37,
          1.0165943e-20,
          -1.7660399e-06,
          1.4487239e-08,
          7.45568e-11,
          1.6075071e-05,
          1.4484036e-05,
          3.3919864e-38,
          4.0626943e-14,
          1.8612554e-06,
          3.9955332e-09,
          -4.512857e-16,
          -1.3437782e-38,
          -2.3390863e-08,
          2.815775e-06,
          -2.6088596e-35,
          -6.9482106e-14,
          3.8962538e-28,
          -3.7364408e-35,
          -3.3404332e-32,
          -7.1927055e-08,
          3.7626547e-28,
          3.644028e-39,
          8.585295e-14,
          2.516327e-39,
          5.019283e-09,
          2.2952546e-38,
          -5.543325e-38,
          3.611202e-08,
          -4.849273e-36,
          -1.6023327e-08,
          -5.7154934e-06,
          1.0109165e-15,
          -4.1786593e-34,
          2.10325e-24,
          -1.5245791e-12,
          -1.32647635e-08,
          -9.776431e-06,
          -5.874648e-31,
          5.914907e-37,
          -5.5696263e-36,
          -4.6088866e-38,
          2.2217912e-07,
          -2.5157065e-31,
          1.667628e-39,
          8.300238e-13,
          -1.2621588e-35,
          2.2140863e-34,
          1.1967506e-08,
          2.307461e-06,
          -5.3624154e-09,
          7.7004444e-07,
          -5.39398e-40,
          -2.6593662e-18,
          -1.251487e-39,
          8.008757e-06,
          1.077509e-39,
          -3.3769662e-28,
          1.8166812e-33,
          -4.0459236e-15,
          -6.782064e-07,
          -2.3895623e-08,
          -2.5459029e-08,
          -3.4665713e-09,
          -1.0851677e-08,
          5.4563515e-32,
          -1.4372724e-10,
          2.2791538e-30,
          1.4140092e-07,
          -5.265247e-39,
          -5.281914e-29,
          -4.384658e-10,
          -3.7397432e-11,
          -3.4980162e-06,
          -6.350702e-10,
          -5.159808e-21,
          -2.5706592e-10,
          -3.368485e-07,
          -4.3928143e-08,
          8.40545e-39,
          -4.6519646e-12,
          1.6556656e-32,
          2.19508e-40,
          -1.1819488e-25,
          -3.7336113e-06,
          1.1376591e-11,
          -2.3973214e-33,
          -4.954671e-07,
          2.8770426e-08,
          5.708529e-07,
          -1.4168357e-06,
          -6.131479e-21,
          3.036889e-11,
          9.000719e-17,
          -1.0357145e-10,
          -2.8341066e-12,
          -2.9383028e-35,
          -2.3937e-39,
          -6.9885e-35,
          -4.984696e-33,
          -1.0193987e-38,
          6.5032285e-17,
          -4.1625544e-06,
          -6.759756e-17,
          -8.4272515e-23,
          1.2793429e-07,
          -1.734526e-39,
          1.75211e-40,
          -1.0981813e-07,
          -2.1951394e-38,
          7.939271e-39,
          -2.0851783e-15,
          1.5480025e-19,
          -5.8473245e-34,
          -0.22852199,
          0.15939097,
          -0.2759838,
          -0.17818388,
          -0.32861677,
          0.19833921,
          0.27476558,
          0.16767494,
          0.22511466,
          -0.011478132,
          -0.38367587,
          0.14174637,
          0.12508392,
          0.066699274,
          -0.20879507,
          -0.39236513,
          -0.28159857,
          -0.062095374,
          0.12934971,
          -0.04698276,
          -0.1410936,
          0.3906243,
          0.064968556,
          -0.2950497,
          -0.23069948,
          -0.3060664,
          -0.16592738,
          -0.17986827,
          -0.249117,
          -0.20610973,
          -0.26178533,
          0.12798393,
          -0.07884077,
          -0.0077827545,
          0.071406186,
          0.29929638,
          -0.24103126,
          -0.008776824,
          0.23856123,
          0.3269268,
          0.35183936,
          -0.29329172,
          -0.14656849,
          0.06023013,
          0.063444436,
          0.13767757,
          0.023335801,
          0.11750312,
          0.13964571,
          -0.14200276,
          -0.23525974,
          -0.097696565,
          0.053400926,
          -0.23040049,
          -0.016172279,
          -0.04842308,
          0.010434799,
          0.0041104774,
          -0.35731205,
          0.0769782,
          -0.08042672,
          -0.21831506,
          0.09491058,
          -0.047158707,
          -0.18785101,
          0.49626198,
          -0.19059756,
          0.102002576,
          -0.28381902,
          0.084496036,
          0.3917825,
          0.074510254,
          -0.0017001195,
          -0.05042193,
          -0.24017765,
          0.3497723,
          0.1963002,
          0.20740864,
          -0.34841174,
          -0.033499856,
          0.08813596,
          -0.21648423,
          -0.28573665,
          0.047283597,
          -0.04945309,
          0.2964682,
          -0.24571471,
          0.0257629,
          -0.16746065,
          -0.32059607,
          -0.26218018,
          0.18683632,
          0.026542006,
          -0.021363096,
          -0.12943164,
          0.14158194,
          0.039939567,
          0.15598346,
          0.049574427,
          -0.04435512,
          -0.044426557,
          -0.046528295,
          0.075135976,
          0.17070027,
          0.014424157,
          0.04516918,
          -0.0781781,
          0.019967698,
          0.07095209,
          0.14225726,
          -0.19978625,
          0.47942534,
          0.064614214,
          -0.076586194,
          -0.2665545,
          0.12008011,
          0.08397899,
          -0.07510618,
          0.3522075,
          0.046669204,
          -0.027166968,
          -0.1382202,
          -0.25593445,
          0.20057324,
          -0.3204548,
          0.048263457,
          0.3394659,
          0.3078433,
          -0.16075042,
          0.42135346,
          -0.4259241,
          0.22950867,
          0.06543126,
          -0.15212055,
          0.06898756,
          -0.4283005,
          -0.14877078,
          0.21494262,
          -0.14552455,
          -0.043064583,
          0.07124962,
          0.052109778,
          -0.3283907,
          -0.07523794,
          -0.47736478,
          0.38171375,
          -0.118453294,
          -0.13903645,
          -0.03886805,
          0.107595004,
          -0.28562936,
          0.33381823,
          0.007030477,
          0.049246248,
          -0.3332401,
          0.23627047,
          0.3866346,
          0.105866976,
          0.18240051,
          0.250065,
          0.46288982,
          -0.20044535,
          0.12554519,
          0.07552164,
          0.0069094826,
          0.40692034,
          0.13719532,
          0.17083481,
          -0.15076955,
          -0.47215077,
          0.45946416,
          -0.024969762,
          -0.30171782,
          0.21935055,
          0.3332027,
          -0.024974547,
          0.16121748,
          0.031033816,
          -0.3245502,
          -0.07392959,
          0.16976109,
          -0.41586244,
          0.062033806,
          -0.19879578,
          -0.04242552,
          0.13620125,
          0.08197316,
          0.16149735,
          -0.040517393,
          -0.024738245,
          0.08120927,
          -0.22160824,
          -0.15672086,
          0.09981533,
          -0.17365108,
          -0.027196584,
          0.5211914,
          -0.19579312,
          -0.06469182,
          -0.16545162,
          -0.15083738,
          0.2208219,
          -0.36709163,
          0.21493877,
          -0.2555153,
          -0.021601778,
          -0.3604275,
          0.27284265,
          -0.25810948,
          0.2320322,
          -0.5062028,
          0.023411112,
          -0.13077672,
          0.079105295,
          -0.24052432,
          0.069369435,
          -0.26028532,
          -0.1247041,
          -0.064976856,
          -0.23729888,
          0.2621378,
          0.07019725,
          0.11486541,
          0.009732273,
          0.2961331,
          -0.033165373,
          -0.18939935,
          -0.15343535,
          0.2809298,
          0.44498047,
          -0.14903955,
          -0.20762898,
          -0.06306205,
          -0.2927439,
          -0.032177128,
          -0.44646752,
          0.12480016,
          0.04883406,
          -0.14513807,
          -0.15426227,
          -0.07251237,
          0.20468831,
          -0.28308323,
          -0.23050265,
          0.1627269,
          -0.31743804,
          0.22215734,
          -0.21804236,
          -0.31408048,
          -0.18392876,
          0.31791613,
          0.41301787,
          0.032961056,
          -1.6818023e-05,
          0.27184913,
          -0.41980428,
          -0.19551633,
          -0.019700857,
          -0.17907001,
          -0.46592253,
          -0.21399769,
          -0.35261428,
          -0.30583438,
          -0.17000732,
          -0.043699868,
          0.07476689,
          0.21245986,
          -0.37426808,
          -0.15422575,
          -0.1848582,
          0.081723526,
          -0.09949464,
          -0.028235301,
          -0.19162868,
          -0.108885966,
          -0.019593505,
          -0.26867673,
          0.45615205,
          0.22930467,
          -0.07112688,
          -0.01787165,
          -0.11051548,
          0.36344355,
          0.05781247,
          0.09037775,
          -0.217491,
          -0.1518875,
          -0.10909546,
          0.1594604,
          0.21746927,
          -0.18791774,
          0.19501911,
          0.20411511,
          0.33270308,
          -0.16174982,
          -0.3025603,
          -0.21392933,
          0.32026026,
          -0.3513974,
          -0.22643168,
          -0.22793968,
          -0.32728574,
          0.14392059,
          0.044320244,
          -0.03989519,
          -0.06873406,
          -0.14781334,
          0.08549002,
          0.38180706,
          0.14859298,
          0.2573818,
          -0.13606559,
          -0.29868683,
          0.24403705,
          -0.061921246,
          -0.06322742,
          0.2482316,
          -0.374622,
          -0.09231733,
          0.078518815,
          -4.681838e-07,
          1.4303328e-35,
          -8.674037e-16,
          -1.3521902e-35,
          1.3452359e-22,
          1.4303267e-31,
          2.5603074e-21,
          -5.2527057e-24,
          5.4310965e-38,
          -3.937049e-39,
          -1.7435393e-29,
          1.2818613e-06,
          -3.0964278e-19,
          -1.072442e-12,
          -5.1984744e-06,
          8.0825503e-19,
          -6.9048616e-37,
          -2.2119327e-06,
          3.76399e-40,
          5.1565276e-36,
          6.413079e-29,
          6.292604e-14,
          -1.13965235e-07,
          -7.0433686e-07,
          -4.0169997e-20,
          -5.2571e-40,
          -4.8902154e-27,
          8.2190746e-38,
          -6.1795125e-16,
          1.6199093e-10,
          1.1385968e-11,
          -2.9801745e-25,
          3.193374e-20,
          1.1918916e-36,
          -2.5695087e-32,
          -2.8549437e-07,
          4.7106445e-07,
          -1.2792356e-08,
          2.3821574e-06,
          3.162037e-38,
          -9.587525e-11,
          -1.0730014e-38,
          2.7437228e-08,
          -2.7461047e-19,
          3.192412e-11,
          6.4141344e-30,
          -2.7877233e-25,
          3.8343035e-09,
          -1.9961668e-16,
          -5.91674e-40,
          -3.2875555e-13,
          1.0587356e-05,
          1.8018092e-06,
          -3.7158006e-06,
          -8.95281e-24,
          7.18598e-07,
          -1.6843142e-10,
          2.2670879e-38,
          4.2609994e-07,
          -4.653458e-06,
          8.249261e-25,
          -5.463845e-24,
          6.8745396e-07,
          5.679921e-06,
          0.29274285,
          -0.07376223,
          0.11495116,
          0.19284675,
          -0.04989907,
          0.1103566,
          -0.396313,
          -0.050440088,
          -0.33094785,
          -0.18690997,
          -0.22977,
          0.08411663,
          -0.05060221,
          0.033680994,
          -0.21042402,
          -0.31465477,
          -0.06034968,
          0.29962316,
          -0.23998776,
          0.1763996,
          0.12527445,
          0.097178936,
          -0.2524387,
          -0.09651399,
          0.24559134,
          -0.19582671,
          0.019133294,
          -0.012708725,
          0.30230743,
          0.26777935,
          0.34510452,
          -0.077919014,
          0.12868758,
          -0.023248244,
          -0.031610068,
          0.14648844,
          0.3138438,
          0.26561427,
          0.18586868,
          -0.13906994,
          0.0050767763,
          0.016682455,
          -0.019111695,
          -0.3876048,
          -0.025581969,
          -0.23896429,
          -0.09424755,
          0.0037202395,
          -0.23982865,
          -0.29245988,
          0.38669875,
          -0.10056881,
          -0.16373412,
          0.05420548,
          -0.031625427,
          0.08519802,
          0.1555392,
          -0.082221106,
          -0.1773178,
          0.22977087,
          0.32371944,
          0.1631799,
          0.13507591,
          -0.36168456,
          0.32154405,
          -0.20239976,
          0.14390136,
          0.08328034,
          0.10852948,
          -0.06608278,
          -0.31293496,
          -0.26161775,
          -0.3356644,
          -0.15236102,
          0.12293505,
          -0.10098042,
          -0.19024423,
          0.17216513,
          0.2051863,
          0.018878048,
          0.17530692,
          -0.01998386,
          -0.18913692,
          0.2451858,
          0.023441968,
          -0.14296779,
          0.043800868,
          0.012015771,
          -0.09338664,
          0.092992574,
          -0.14199305,
          0.010998403,
          -0.14978972,
          0.30803317,
          -0.048543308,
          -0.19749336,
          0.19628848,
          0.2734522,
          0.18112403,
          0.2442114,
          0.19901921,
          0.038036473,
          -0.17473081,
          -0.15044522,
          -0.015664242,
          -0.25708953,
          0.24141052,
          -0.174848,
          -0.17434494,
          -0.2784243,
          0.11392794,
          -0.07684473,
          0.19731219,
          -0.045709264,
          0.104199514,
          -0.0047656903,
          0.07037495,
          -0.14081897,
          0.21473701,
          -0.11749108,
          -0.14113139,
          0.3394004,
          0.032500956,
          0.111504175,
          0.27216652,
          0.38571987,
          0.18406174,
          -0.0065183877,
          0.08897046,
          0.11683444,
          0.23810434,
          0.26966706,
          -0.10875253,
          0.23585425,
          0.068520844,
          -0.3803763,
          0.25080398,
          -0.5244614,
          0.016740724,
          0.28900132,
          -0.07111575,
          0.2606095,
          0.1411291,
          0.1920736,
          -0.23058322,
          -0.32879627,
          -0.0028420335,
          0.2673517,
          0.17161737,
          0.010744766,
          0.09977214,
          -0.3525036,
          0.21211901,
          -0.18591183,
          -0.08344419,
          0.12753491,
          0.40518814,
          0.21200651,
          -0.051646437,
          0.3342477,
          -0.5240506,
          0.5442017,
          -0.0014004583,
          -0.22659206,
          -0.22706094,
          0.2205731,
          -0.3685813,
          0.14906166,
          -0.049329314,
          0.096536495,
          -0.4574011,
          0.29056102,
          0.4224225,
          0.0056204707,
          -0.029439934,
          -0.15444288,
          0.23979154,
          -0.27552107,
          -0.19300535,
          0.053597376,
          0.07587786,
          0.064846866,
          0.019840414,
          0.2097929,
          -0.25284067,
          0.13015902,
          -0.18392847,
          0.03464744,
          -0.23163104,
          0.10174832,
          -0.055095363,
          -0.27217865,
          -0.42042005,
          0.16085279,
          0.07689154,
          0.16973065,
          0.36305085,
          -0.10185858,
          0.1731508,
          0.201812,
          0.33794597,
          0.17902854,
          -0.26729876,
          0.035194255,
          0.33809108,
          -0.06597361,
          0.026131686,
          -0.020082224,
          -0.13169344,
          -0.38654605,
          0.28110892,
          0.037169144,
          0.14155933,
          -0.1452045,
          0.09540827,
          -0.33429903,
          0.26339808,
          0.4332318,
          -0.106219865,
          0.300447,
          0.09439883,
          0.086364366,
          -0.2956316,
          -0.2248814,
          0.111654244,
          -0.14005627,
          0.0771037,
          -0.09048051,
          -0.21088234,
          -0.33681563,
          -0.08296761,
          0.3714972,
          -0.35955757,
          -0.20064832,
          -0.24189831,
          -0.075587764,
          0.09741638,
          0.35302085,
          -0.15683527,
          0.07082864,
          -0.3947291,
          -0.4177288,
          -0.18676528,
          0.0472901,
          0.25317624,
          -0.28328413,
          0.11202974,
          0.37162364,
          0.058329012,
          -0.27376792,
          -0.03208868,
          -0.38482532,
          -0.18571502,
          0.22002406,
          -0.07165518,
          0.07602035
        ],
        "name": "coefficient"
      },
      {
        "dims": [
          "1",
          "64"
        ],
        "dataType": 1,
        "floatData": [
          0.05519036,
          0.11052251,
          0.0029918815,
          -0.29695025,
          -0.13538814,
          0.07283467,
          -0.20135173,
          -0.044161964,
          -0.09883049,
          -0.2615338,
          -0.051216103,
          -0.20423327,
          0.19137919,
          0.038416624,
          0.23311973,
          -0.19786273,
          -0.04085688,
          -0.16190305,
          -0.124865465,
          0.23929374,
          -0.37129706,
          0.17513357,
          -0.21581982,
          0.036438767,
          0.06818668,
          0.19461402,
          0.11866347,
          0.2662445,
          -0.059400145,
          0.13305674,
          -0.25748107,
          0.27267766,
          0.23719393,
          0.26561922,
          0.122987136,
          0.0023122837,
          -0.042718798,
          0.07818623,
          -0.29937327,
          -0.18634383,
          -0.1911527,
          -0.060270555,
          0.1921891,
          -0.22004795,
          0.27923366,
          -0.12058104,
          -0.24133989,
          0.072745524,
          -0.012180202,
          0.081081405,
          0.21234757,
          0.082034044,
          -0.25107297,
          0.35130438,
          0.44721,
          0.061831325,
          -0.05576474,
          0.14451306,
          -0.12460791,
          -0.32915732,
          -0.0826996,
          0.13471942,
          0.31318974,
          0.28233868
        ],
        "name": "intercepts"
      },
      {
        "dims": [
          "64",
          "5"
        ],
        "dataType": 1,
        "floatData": [
          0.21350428,
          -0.022537488,
          -0.4617322,
          -0.2949952,
          0.48282877,
          -0.38609412,
          0.38436118,
          0.16769432,
          -0.33779532,
          0.14211275,
          0.1390038,
          0.30101338,
          -0.08302772,
          -0.4455951,
          -0.15295453,
          0.11278771,
          0.41750762,
          -0.73104745,
          0.1300288,
          -0.025405686,
          0.15535979,
          -0.44129968,
          0.37628976,
          0.29649892,
          -0.4317282,
          -0.106680766,
          0.4773645,
          -0.22447169,
          0.09136242,
          -0.25889468,
          -0.37135795,
          0.39789066,
          -0.3689938,
          0.12777239,
          0.0044802,
          -0.011033494,
          -0.47981638,
          -0.19351435,
          0.6909111,
          -0.29283634,
          -0.0719204,
          -0.08488752,
          0.32220858,
          -0.57228595,
          0.5226658,
          -0.11374867,
          0.0014537605,
          -0.4366403,
          -0.3697166,
          0.15071566,
          -0.19942263,
          0.38707852,
          -0.17097217,
          -0.55120355,
          0.080258034,
          0.1944191,
          -0.23367013,
          -0.17723332,
          -0.6281264,
          0.42393136,
          -0.064658016,
          -0.11372781,
          0.15737443,
          0.23703028,
          0.24091,
          0.17167659,
          -0.3211606,
          -0.20350851,
          0.051763996,
          -0.26897278,
          -0.025194457,
          0.4423979,
          -0.5616757,
          -0.32170102,
          -0.07106272,
          0.4414306,
          -0.22023311,
          0.27315536,
          -0.37498656,
          -0.40439373,
          0.3668759,
          0.38717946,
          -0.37247327,
          0.0014069915,
          0.0061233267,
          0.21118012,
          -0.25495106,
          0.118260205,
          -0.3417678,
          0.38879335,
          -0.47989023,
          -0.37119338,
          -0.37366065,
          0.42347503,
          -0.07683288,
          0.086148486,
          0.19686301,
          -0.46452165,
          0.3725948,
          -0.0922351,
          0.29444307,
          -0.36795995,
          -0.42851457,
          0.48265618,
          0.13106927,
          0.020211019,
          -0.12330563,
          0.10431669,
          0.39091283,
          0.02325166,
          -0.33747238,
          0.41545182,
          0.045381527,
          -0.15943277,
          -0.13621649,
          0.09015265,
          -0.0022875662,
          0.15255281,
          -0.6539842,
          0.29925492,
          0.25141662,
          -0.45307386,
          0.25990278,
          0.13068117,
          0.25989664,
          0.021826481,
          -0.2115163,
          0.15918821,
          0.53047156,
          0.025972538,
          -0.1710623,
          0.17767654,
          0.22409196,
          -0.10980218,
          0.25629556,
          -0.11778478,
          0.1777962,
          -0.40274504,
          0.20070288,
          -0.26612929,
          -0.08498139,
          -0.3722321,
          0.0039418717,
          0.30720437,
          -0.11406969,
          0.10463304,
          -0.13958701,
          -0.48126525,
          -0.050047453,
          -0.44757092,
          0.14432816,
          0.19610885,
          -0.24999341,
          -0.26475063,
          -0.0067917095,
          0.14450167,
          0.18631104,
          0.16261804,
          -0.43202534,
          -0.2435459,
          -0.30631605,
          0.11145642,
          0.14521536,
          -0.24787407,
          0.23912159,
          0.22411425,
          0.29416385,
          0.2947167,
          0.20175819,
          -0.62564695,
          -0.4083944,
          -0.45528996,
          0.13608204,
          0.37815234,
          0.01688315,
          0.19320694,
          -0.26525632,
          0.34185565,
          -0.047448143,
          -0.28176323,
          -0.18227711,
          -0.18481822,
          -0.11816043,
          -0.11233911,
          0.33456796,
          0.066576265,
          -0.6163084,
          0.15849003,
          0.37175557,
          -0.13219447,
          -0.18572308,
          -0.26534906,
          -0.15232489,
          0.41284072,
          -0.56668484,
          -0.23446798,
          0.46900976,
          -0.821777,
          0.16915537,
          -0.25516954,
          0.32449913,
          0.08265799,
          0.3649128,
          -0.039066747,
          -0.6985483,
          -0.095077336,
          0.614706,
          -0.7296903,
          0.20087337,
          0.091226354,
          -0.26534286,
          -0.1355635,
          0.055366114,
          -0.37648758,
          0.47568586,
          0.20073922,
          -0.36554158,
          -0.17695391,
          0.5320999,
          -0.38752767,
          0.22803761,
          0.07152768,
          0.12642114,
          -0.6727068,
          0.12870549,
          -0.2630062,
          0.1565015,
          -0.1636247,
          0.08134478,
          0.31083572,
          -0.29514733,
          -0.3652995,
          -0.15342137,
          0.0065257004,
          0.2814683,
          -0.15544446,
          -0.13674217,
          -0.33391595,
          0.31972227,
          -0.04754527,
          0.37710902,
          -0.47568384,
          0.337744,
          -0.08713703,
          -0.014945836,
          -0.101864226,
          0.13866144,
          0.51280665,
          -0.22717147,
          -0.31261072,
          0.19177465,
          0.117715836,
          -0.37102494,
          -0.25979376,
          -0.31376934,
          0.23580605,
          -0.3834255,
          0.01057032,
          -0.065503955,
          -0.09146764,
          -0.48629138,
          0.24751514,
          -0.10204423,
          -0.10089495,
          -0.11697806,
          0.047949668,
          0.36515525,
          -0.24503584,
          -0.03972422,
          -0.21168755,
          -0.26919833,
          0.14839773,
          0.39714858,
          0.06999257,
          0.075993754,
          0.15431653,
          -0.10644069,
          -0.40141356,
          0.13964957,
          0.32817695,
          -0.19478935,
          0.19189522,
          -0.26561216,
          0.0393475,
          -0.5116215,
          -0.13949524,
          -0.006110618,
          -0.32236928,
          0.32896093,
          0.27487493,
          0.298155,
          -0.1264216,
          -0.050839387,
          -0.7635655,
          0.4739625,
          0.18561494,
          -0.4862813,
          0.6006228,
          -0.14433196,
          0.31131098,
          -0.3687899,
          0.2370742,
          -0.4191268,
          0.119743824,
          0.3238421,
          0.19467133,
          -0.31653693,
          -0.6233824,
          -0.098163374,
          0.103398874,
          -0.30514032,
          0.3780018,
          0.05058266,
          -0.22463515,
          -0.032259874,
          -0.14973158,
          0.17983912,
          -0.21682785,
          0.48810554,
          -0.2534228
        ],
        "name": "coefficient1"
      },
      {
        "dims": [
          "1",
          "5"
        ],
        "dataType": 1,
        "floatData": [
          0.18058099,
          0.25557503,
          -0.11429736,
          0.2468522,
          -0.21247905
        ],
        "name": "intercepts1"
      },
      {
        "dims": [
          "5"
        ],
        "dataType": 6,
        "int32Data": [
          0,
          1,
          2,
          3,
          4
        ],
        "name": "classes"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "-1"
        ],
        "name": "shape_tensor"
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {},
                {
                  "dimValue": "20"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "output_label",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {}
              ]
            }
          }
        }
      },
      {
        "name": "output_probability",
        "type": {
          "sequenceType": {
            "elemType": {
              "mapType": {
                "keyType": 7,
                "valueType": {
                  "tensorType": {
                    "elemType": 1
                  }
                }
              }
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "",
      "version": "21"
    },
    {
      "domain": "ai.onnx.ml",
      "version": "1"
    }
  ]
}